bhavilbhanushali28-ai/esp8266-build1/aqua/WiFiManager.cpp
// ============================================================
// WiFiManager.cpp - Intermittent WiFi with Smart AP Fallback
// Version: 2.1 - Fixed for ArduinoDroid compatibility
// ============================================================

#include "WiFiManager.h"
#include <ESP8266WiFi.h>
#include "WiFiConfig.h"
// Remove the struct and array definitions from here
/*
// Hardcoded networks
struct HardcodedNetwork {
    const char* ssid;
    const char* password;
};
const HardcodedNetwork hardcodedNetworks[] = {
    {"realme 5g", "bhavil23!"},
    {"ishwar", "12345689"}, // Example 2
    {"note 5pro", "bhavil23!"},    // Example 3
    {"lenovo", "12345678"}  
};
//const size_t NUM_HARDCODED_NETWORKS = sizeof(hardcodedNetworks) / sizeof(hardcodedNetworks[0]);

const size_t NUM_HARDCODED_NETWORKS = sizeof(hardcodedNetworks) / sizeof(hardcodedNetworks[0]);
*/

// Add this near the top of WiFiManager.cpp (after includes)
#ifndef WL_WRONG_PASSWORD
#define WL_WRONG_PASSWORD 6
#endif

// ===================== EXTERNAL REFERENCES =====================
extern struct Settings {
    char staSsid[33];
    char staPassword[65];
} settings;
/*
extern struct HardcodedNetwork {
    const char* ssid;
    const char* password;
} hardcodedNetworks[];
*/

extern const size_t NUM_HARDCODED_NETWORKS;

extern bool wifiConnected;
extern bool isApModeActive;
extern bool isMidCycleWake;
extern bool telegramTriggeredForThisConnection;
extern bool telegramSendPending;
extern bool telegramDelayActive;
extern bool telegramSending;
extern uint8_t telegramRetryCount;
extern unsigned long lastTimeSync;

extern void setupAP(void);
extern void checkAPTimeout(void);
extern void syncTimeFromNTP(void);
extern void saveSettings(void);

// ===================== MODULE VARIABLES =====================
static WifiMgrContext ctx;
static WifiMgrRTCData rtcWiFiData;

static WiFiEventHandler onConnectedHandler;
static WiFiEventHandler onDisconnectedHandler;
static WiFiEventHandler onGotIPHandler;

// ===================== STATE NAMES =====================
static const char* STATE_NAMES[] = {
    "IDLE", "SCANNING", "CONNECTING_SAVED", "CONNECTING_HARDCODED",
    "CONNECTED", "AP_MODE", "WAITING_BACKOFF", "HUNT_SCANNING",
    "HUNT_CONNECTING", "HUNT_LIGHT_SLEEP"
};

static const char* FAILURE_NAMES[] = {
    "NONE", "TIMEOUT", "WRONG_PASSWORD", "SSID_NOT_FOUND",
    "CONNECTION_LOST", "POOR_SIGNAL", "UNKNOWN"
};

// ===================== FORWARD DECLARATIONS =====================
static void onWiFiStationConnected(const WiFiEventStationModeConnected& event);
static void onWiFiStationDisconnected(const WiFiEventStationModeDisconnected& event);
static void onWiFiGotIP(const WiFiEventStationModeGotIP& event);

static void handleNormalMode(uint32_t now);
static void handleIntermittentMode(uint32_t now);

static void handleIdleState(uint32_t now);
static void handleScanningState(uint32_t now);
static void handleConnectingSavedState(uint32_t now);
static void handleConnectingHardcodedState(uint32_t now);
static void handleConnectedState(uint32_t now);
static void handleBackoffState(uint32_t now);
static void handleAPModeState(uint32_t now);
static void handleHuntScanningState(uint32_t now);
static void handleHuntConnectingState(uint32_t now);
static void handleHuntLightSleepState(uint32_t now);

static void transitionState(WifiMgrState newState, const char* reason);
static bool tryConnectToNetwork(const char* ssid, const char* password);
static void tryConnectToHardcodedNetwork(uint8_t index);
static bool startAsyncScan(void);
static bool isTargetInScanResults(int scanCount);
static void cacheAvailableNetworks(int scanCount);
static uint32_t calculateBackoffDelay(void);

static void handleWrongPassword(void);
static void handleAuthFailure(void);
static void handleSSIDNotFound(void);
static void handlePoorSignalDisconnect(void);
static bool shouldFallbackToAP(void);
static void enterAPMode(const char* reason, bool authFailure, bool poorSignal);
static void exitAPMode(void);

static void onConnectionEstablished(void);
static void onConnectionLost(void);
static void onHuntConnectionEstablished(void);
static void saveConnectedCredentialsIfNew(void);

static void exitLightSleep(void);
static void yieldWithLightSleep(uint32_t ms);

static void loadRTCWiFiData(void);
static void saveRTCWiFiData(void);
static uint32_t calculateCRC32(const uint8_t* data, size_t length);

static const char* getSignalQuality(int8_t rssi);

// ===================== CONTEXT INITIALIZATION =====================
static void initContext(void) {
    ctx.state = WIFI_MGR_IDLE;
    ctx.previousState = WIFI_MGR_IDLE;
    ctx.operationMode = WIFI_OP_MODE_NORMAL;
    ctx.lastFailureType = WIFI_FAIL_NONE;
    
    ctx.lastAttemptTime = 0;
    ctx.connectionStartTime = 0;
    ctx.lastScanTime = 0;
    ctx.lastScanCompleteTime = 0;
    ctx.huntStartTime = 0;
    ctx.lastSuccessfulConnection = 0;
    ctx.lastTargetSeenTime = 0;
    ctx.apModeStartTime = 0;
    ctx.lightSleepStartTime = 0;
    ctx.goodSignalStartTime = 0;
    
    ctx.savedNetworkAttempts = 0;
    ctx.currentHardcodedIndex = 0;
    ctx.backoffMultiplier = 1;
    ctx.quickRetryCount = 0;
    ctx.wrongPasswordCount = 0;
    ctx.authFailureCount = 0;
    ctx.consecutiveScanMisses = 0;
    ctx.consecutiveDisconnects = 0;
    ctx.totalScanCount = 0;
    
    ctx.poorSignalDisconnectCount = 0;
    ctx.poorSignalWindowStart = 0;
    ctx.lastConnectedRSSI = -100;
    ctx.lastDisconnectWasPoorSignal = false;
    ctx.lastDisconnectTime = 0;
    
    ctx.scanResultsCached = false;
    ctx.wifiEventRegistered = false;
    ctx.targetNetworkEverSeen = false;
    ctx.apModeTriggeredByAuthFail = false;
    ctx.apModeTriggeredByPoorSignal = false;
    ctx.scanInProgress = false;
    ctx.isConnecting = false;
    
    ctx.availableNetworkCount = 0;
    ctx.lastRSSI = -100;
    ctx.bestSeenRSSI = -100;
    
    memset(ctx.cachedNetworkIndices, 0, sizeof(ctx.cachedNetworkIndices));
    memset(ctx.targetSSID, 0, sizeof(ctx.targetSSID));
}

