bhavilbhanushali28-ai/esp8266-build1/aqua/WiFiManager.cpp
// ===================== INITIALIZATION =====================
void initWiFiManager(void) {
    Serial.println(F("\nðŸ”§ ===== Initializing WiFi Manager ====="));
    
    // Initialize context
    initContext();
    
    // Register event handlers once
    if (!ctx.wifiEventRegistered) {
        onConnectedHandler = WiFi.onStationModeConnected(onWiFiStationConnected);
        onDisconnectedHandler = WiFi.onStationModeDisconnected(onWiFiStationDisconnected);
        onGotIPHandler = WiFi.onStationModeGotIP(onWiFiGotIP);
        ctx.wifiEventRegistered = true;
        Serial.println(F("   âœ“ Event handlers registered"));
    }
    
    // Load RTC data
    loadRTCWiFiData();
    
    // Configure WiFi
    WiFi.setAutoReconnect(false);
    WiFi.persistent(false);
    WiFi.setPhyMode(WIFI_PHY_MODE_11N);
    WiFi.setOutputPower(20.5);
    
    // Set target SSID
    if (strlen(settings.staSsid) > 0) {
        strncpy(ctx.targetSSID, settings.staSsid, sizeof(ctx.targetSSID) - 1);
        ctx.targetSSID[sizeof(ctx.targetSSID) - 1] = '\0';
        Serial.print(F("   Target SSID: "));
        Serial.println(ctx.targetSSID);
    }
    
    ctx.targetNetworkEverSeen = rtcWiFiData.targetEverSeen;
    ctx.huntStartTime = millis();
    
    transitionState(WIFI_MGR_IDLE, "init");
    
    Serial.print(F("   Mode: "));
    Serial.println(ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT 
                   ? "INTERMITTENT_HUNT" : "NORMAL");
    Serial.println(F("========================================\n"));
}

// ===================== PUBLIC FUNCTIONS =====================
WifiMgrState getWiFiState(void) {
    return ctx.state;
}

const char* getWiFiStateName(void) {
    return getWiFiStateNameByState(ctx.state);
}

const char* getWiFiStateNameByState(WifiMgrState state) {
    if (state < WIFI_MGR_STATE_COUNT) {
        return STATE_NAMES[state];
    }
    return "UNKNOWN";
}

WifiMgrFailureType getLastFailureType(void) {
    return ctx.lastFailureType;
}

const char* getFailureTypeName(WifiMgrFailureType type) {
    if (type <= WIFI_FAIL_UNKNOWN) {
        return FAILURE_NAMES[type];
    }
    return "UNKNOWN";
}

void setWiFiOperationMode(WifiMgrOperationMode mode) {
    WifiMgrOperationMode oldMode = ctx.operationMode;
    ctx.operationMode = mode;
    
    if (mode != oldMode) {
        if (mode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
            Serial.println(F("\nðŸŽ¯ Mode: INTERMITTENT_HUNT"));
            ctx.huntStartTime = millis();
            ctx.backoffMultiplier = 1;
            
            if (ctx.state != WIFI_MGR_CONNECTED && ctx.state != WIFI_MGR_AP_MODE) {
                transitionState(WIFI_MGR_HUNT_SCANNING, "mode change");
            }
        } else {
            Serial.println(F("\nðŸ“¶ Mode: NORMAL"));
            if (ctx.state != WIFI_MGR_CONNECTED && ctx.state != WIFI_MGR_AP_MODE) {
                transitionState(WIFI_MGR_IDLE, "mode change");
            }
        }
    }
}

WifiMgrOperationMode getWiFiOperationMode(void) {
    return ctx.operationMode;
}

void enableIntermittentHuntMode(void) {
    setWiFiOperationMode(WIFI_OP_MODE_INTERMITTENT_HUNT);
}

void disableIntermittentHuntMode(void) {
    setWiFiOperationMode(WIFI_OP_MODE_NORMAL);
}

bool isInHuntMode(void) {
    return ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT;
}

bool isWiFiConnected(void) {
    return ctx.state == WIFI_MGR_CONNECTED && WiFi.status() == WL_CONNECTED;
}

uint32_t getTimeSinceLastConnection(void) {
    if (ctx.lastSuccessfulConnection == 0) return 0xFFFFFFFF;
    return millis() - ctx.lastSuccessfulConnection;
}

uint32_t getTimeSinceTargetSeen(void) {
    if (ctx.lastTargetSeenTime == 0) return 0xFFFFFFFF;
    return millis() - ctx.lastTargetSeenTime;
}

bool hasTargetBeenSeen(void) {
    return ctx.targetNetworkEverSeen;
}

int8_t getLastRSSI(void) {
    return ctx.lastRSSI;
}

int8_t getCurrentRSSI(void) {
    if (WiFi.status() == WL_CONNECTED) return WiFi.RSSI();
    return ctx.lastRSSI;
}

uint16_t getTotalScanCount(void) {
    return ctx.totalScanCount;
}

uint8_t getPoorSignalDisconnectCount(void) {
    return ctx.poorSignalDisconnectCount;
}

uint8_t getWrongPasswordCount(void) {
    return ctx.wrongPasswordCount;
}

uint8_t getAuthFailureCount(void) {
    return ctx.authFailureCount;
}

void resetWiFiManager(void) {
    Serial.println(F("ðŸ”„ Resetting WiFi Manager..."));
    
    WiFi.disconnect(true);
    WiFi.scanDelete();
    delay(100);
    
    WifiMgrOperationMode savedMode = ctx.operationMode;
    initContext();
    ctx.operationMode = savedMode;
    ctx.huntStartTime = millis();
    
    wifiConnected = false;
    isApModeActive = false;
}

void resetFailureCounters(void) {
    ctx.wrongPasswordCount = 0;
    ctx.authFailureCount = 0;
    ctx.poorSignalDisconnectCount = 0;
    ctx.poorSignalWindowStart = 0;
    ctx.lastFailureType = WIFI_FAIL_NONE;
}

void forceAPMode(const char* reason) {
    enterAPMode(reason, false, false);
}

void exitAPModeAndResume(void) {
    exitAPMode();
}

void setTargetSSID(const char* ssid) {
    strncpy(ctx.targetSSID, ssid, sizeof(ctx.targetSSID) - 1);
    ctx.targetSSID[sizeof(ctx.targetSSID) - 1] = '\0';
    ctx.targetNetworkEverSeen = false;
    ctx.lastTargetSeenTime = 0;
    ctx.wrongPasswordCount = 0;
    ctx.authFailureCount = 0;
}

// ===================== MAIN STATE MACHINE =====================
void manageWiFiConnection(void) {
    if (isMidCycleWake) return;
    
    uint32_t now = millis();
    
    if (ctx.state == WIFI_MGR_AP_MODE) {
        handleAPModeState(now);
        return;
    }
    
    if (WiFi.getMode() != WIFI_STA && ctx.state != WIFI_MGR_AP_MODE) {
        WiFi.mode(WIFI_STA);
        delay(10);
    }
    
    if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
        handleIntermittentMode(now);
    } else {
        handleNormalMode(now);
    }
}

// ===================== MODE HANDLERS =====================
static void handleNormalMode(uint32_t now) {
    switch (ctx.state) {
        case WIFI_MGR_IDLE: handleIdleState(now); break;
        case WIFI_MGR_SCANNING: handleScanningState(now); break;
        case WIFI_MGR_CONNECTING_SAVED: handleConnectingSavedState(now); break;
        case WIFI_MGR_CONNECTING_HARDCODED: handleConnectingHardcodedState(now); break;
        case WIFI_MGR_CONNECTED: handleConnectedState(now); break;
        case WIFI_MGR_WAITING_BACKOFF: handleBackoffState(now); break;
        default: transitionState(WIFI_MGR_IDLE, "invalid"); break;
    }
}

static void handleIntermittentMode(uint32_t now) {
    switch (ctx.state) {
        case WIFI_MGR_IDLE: transitionState(WIFI_MGR_HUNT_SCANNING, "hunt"); break;
        case WIFI_MGR_HUNT_SCANNING: handleHuntScanningState(now); break;
        case WIFI_MGR_HUNT_CONNECTING: handleHuntConnectingState(now); break;
        case WIFI_MGR_HUNT_LIGHT_SLEEP: handleHuntLightSleepState(now); break;
        case WIFI_MGR_CONNECTED: handleConnectedState(now); break;
        case WIFI_MGR_AP_MODE: handleAPModeState(now); break;
        default: transitionState(WIFI_MGR_HUNT_SCANNING, "recovery"); break;
    }
}

// ===================== STATE HANDLERS =====================
static void handleIdleState(uint32_t now) {
    ctx.connectionStartTime = now;
    ctx.lastAttemptTime = now;
    
    if (strlen(settings.staSsid) > 0) {
        Serial.println(F("ðŸ“¡ Trying saved network..."));
        tryConnectToNetwork(settings.staSsid, settings.staPassword);
        transitionState(WIFI_MGR_CONNECTING_SAVED, "saved");
    } else {
        transitionState(WIFI_MGR_SCANNING, "no saved");
    }
}

static void handleScanningState(uint32_t now) {
    if (!ctx.scanInProgress) {
        if (startAsyncScan()) ctx.scanInProgress = true;
        return;
    }
    
    int8_t scanResult = WiFi.scanComplete();
    if (scanResult == -1) return;
    
