bhavilbhanushali28-ai/esp8266-build1/aqua/WiFiManager.cpp
    ctx.scanInProgress = false;
    
    if (scanResult < 0) {
        transitionState(WIFI_MGR_WAITING_BACKOFF, "scan fail");
        return;
    }
    
    ctx.totalScanCount++;
    cacheAvailableNetworks(scanResult);
    WiFi.scanDelete();
    
    if (ctx.availableNetworkCount > 0) {
        ctx.currentHardcodedIndex = 0;
        tryConnectToHardcodedNetwork(0);
        transitionState(WIFI_MGR_CONNECTING_HARDCODED, "found");
    } else {
        handleSSIDNotFound();
    }
}

static void handleConnectingSavedState(uint32_t now) {
    wl_status_t status = WiFi.status();
    
    if (status == WL_CONNECTED) return;
    if (status == WL_WRONG_PASSWORD) { handleWrongPassword(); return; }
    if (status == WL_CONNECT_FAILED) { handleAuthFailure(); return; }
    if (status == WL_NO_SSID_AVAIL) { handleSSIDNotFound(); return; }
    
    if (now - ctx.lastAttemptTime >= WIFIMGR_MAX_CONNECT_TIMEOUT_MS) {
        ctx.savedNetworkAttempts++;
        if (ctx.savedNetworkAttempts >= WIFIMGR_MAX_STA_ATTEMPTS) {
            transitionState(WIFI_MGR_SCANNING, "max attempts");
        } else {
            transitionState(WIFI_MGR_WAITING_BACKOFF, "timeout");
        }
    }
}

static void handleConnectingHardcodedState(uint32_t now) {
    wl_status_t status = WiFi.status();
    
    if (status == WL_CONNECTED) return;
    if (status == WL_WRONG_PASSWORD) { handleWrongPassword(); return; }
    if (status == WL_CONNECT_FAILED) { handleAuthFailure(); return; }
    
    if (now - ctx.lastAttemptTime >= WIFIMGR_MAX_CONNECT_TIMEOUT_MS) {
        ctx.currentHardcodedIndex++;
        if (ctx.currentHardcodedIndex < ctx.availableNetworkCount) {
            tryConnectToHardcodedNetwork(ctx.currentHardcodedIndex);
            ctx.lastAttemptTime = now;
        } else {
            if (!shouldFallbackToAP()) {
                transitionState(WIFI_MGR_WAITING_BACKOFF, "all tried");
            }
        }
    }
}

static void handleConnectedState(uint32_t now) {
    if (WiFi.status() != WL_CONNECTED) {
        onConnectionLost();
        if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
            transitionState(WIFI_MGR_HUNT_SCANNING, "lost");
        } else {
            transitionState(WIFI_MGR_IDLE, "lost");
        }
        return;
    }
    
    // Track RSSI
    static uint32_t lastRSSICheck = 0;
    if (now - lastRSSICheck >= 1000) {
        lastRSSICheck = now;
        ctx.lastConnectedRSSI = WiFi.RSSI();
        ctx.lastRSSI = ctx.lastConnectedRSSI;
        if (ctx.lastRSSI > ctx.bestSeenRSSI) ctx.bestSeenRSSI = ctx.lastRSSI;
    }
    
    // Reset poor signal counter after stable good connection
    if (ctx.lastConnectedRSSI >= WIFIMGR_POOR_SIGNAL_THRESHOLD_DBM) {
        if (ctx.goodSignalStartTime == 0) {
            ctx.goodSignalStartTime = now;
        } else if (now - ctx.goodSignalStartTime >= WIFIMGR_GOOD_SIGNAL_RESET_MS) {
            if (ctx.poorSignalDisconnectCount > 0) {
                ctx.poorSignalDisconnectCount = 0;
                ctx.poorSignalWindowStart = 0;
            }
            ctx.goodSignalStartTime = now;
        }
    } else {
        ctx.goodSignalStartTime = 0;
    }
    
    ctx.consecutiveDisconnects = 0;
}

static void handleBackoffState(uint32_t now) {
    uint32_t backoffDelay = calculateBackoffDelay();
    yieldWithLightSleep(10);
    
    if (now - ctx.lastAttemptTime >= backoffDelay) {
        transitionState(WIFI_MGR_IDLE, "backoff done");
    }
}

static void handleAPModeState(uint32_t now) {
    checkAPTimeout();
    
    if (WIFIMGR_AP_AUTO_EXIT_ENABLED && 
        ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
        uint32_t apTimeout = ctx.apModeTriggeredByAuthFail 
                             ? WIFIMGR_AP_MODE_DURATION_MS * 2 
                             : WIFIMGR_AP_MODE_DURATION_MS;
        
        if (now - ctx.apModeStartTime >= apTimeout) {
            if (WiFi.softAPgetStationNum() == 0) {
                exitAPMode();
            }
        }
    }
}

// ===================== HUNT MODE HANDLERS =====================
static void handleHuntScanningState(uint32_t now) {
    if (shouldFallbackToAP()) return;
    
    if (!ctx.scanInProgress) {
        Serial.println(F("ðŸ” Hunt scan..."));
        if (startAsyncScan()) ctx.scanInProgress = true;
        return;
    }
    
    int8_t scanResult = WiFi.scanComplete();
    if (scanResult == -1) { yieldWithLightSleep(10); return; }
    
    ctx.scanInProgress = false;
    ctx.totalScanCount++;
    
    if (scanResult < 0) {
        transitionState(WIFI_MGR_HUNT_LIGHT_SLEEP, "scan fail");
        return;
    }
    
    Serial.printf("   Found %d networks\n", scanResult);
    ctx.lastScanCompleteTime = now;
    
    bool targetFound = isTargetInScanResults(scanResult);
    WiFi.scanDelete();
    
    if (targetFound) {
        Serial.println(F("ðŸŽ¯ TARGET FOUND!"));
        ctx.targetNetworkEverSeen = true;
        ctx.lastTargetSeenTime = now;
        ctx.consecutiveScanMisses = 0;
        ctx.quickRetryCount = 0;
        
        rtcWiFiData.targetEverSeen = true;
        saveRTCWiFiData();
        
        if (strlen(settings.staSsid) > 0) {
            tryConnectToNetwork(settings.staSsid, settings.staPassword);
        } else {
            for (size_t i = 0; i < NUM_HARDCODED_NETWORKS; i++) {
                if (strcmp(hardcodedNetworks[i].ssid, ctx.targetSSID) == 0) {
                    tryConnectToNetwork(hardcodedNetworks[i].ssid, 
                                        hardcodedNetworks[i].password);
                    break;
                }
            }
        }
        transitionState(WIFI_MGR_HUNT_CONNECTING, "found");
    } else {
        ctx.consecutiveScanMisses++;
        transitionState(WIFI_MGR_HUNT_LIGHT_SLEEP, "not found");
    }
}

static void handleHuntConnectingState(uint32_t now) {
    wl_status_t status = WiFi.status();
    
    if (status == WL_CONNECTED) return;
    if (status == WL_WRONG_PASSWORD) { handleWrongPassword(); return; }
    
    if (status == WL_CONNECT_FAILED) {
        ctx.authFailureCount++;
        if (ctx.authFailureCount >= WIFIMGR_MAX_AUTH_FAILURES) {
            enterAPMode("Auth failed", true, false);
            return;
        }
    }
    
    if (now - ctx.lastAttemptTime >= WIFIMGR_HUNT_CONNECT_TIMEOUT_MS) {
        ctx.quickRetryCount++;
        if (ctx.quickRetryCount < WIFIMGR_HUNT_MAX_QUICK_RETRIES) {
            if (strlen(settings.staSsid) > 0) {
                tryConnectToNetwork(settings.staSsid, settings.staPassword);
            }
            ctx.lastAttemptTime = now;
        } else {
            ctx.quickRetryCount = 0;
            transitionState(WIFI_MGR_HUNT_SCANNING, "retries done");
        }
    }
}

static void handleHuntLightSleepState(uint32_t now) {
    if (ctx.lightSleepStartTime == 0) {
        ctx.lightSleepStartTime = now;
        WiFi.forceSleepBegin();
        delay(1);
    }
    
    if (now - ctx.lightSleepStartTime >= WIFIMGR_HUNT_LIGHT_SLEEP_MS) {
        exitLightSleep();
        ctx.lightSleepStartTime = 0;
        transitionState(WIFI_MGR_HUNT_SCANNING, "sleep done");
    } else {
        delay(100);
    }
}

// ===================== EVENT CALLBACKS =====================
static void onWiFiStationConnected(const WiFiEventStationModeConnected& event) {
    Serial.print(F("ðŸ“¶ Associated: "));
    Serial.println(event.ssid.c_str());
    ctx.isConnecting = true;
}

