bhavilbhanushali28-ai/esp8266-build1/aqua/WiFiManager.cpp
static void onWiFiStationDisconnected(const WiFiEventStationModeDisconnected& event) {
    uint32_t now = millis();
    
    Serial.println(F("\nâŒ DISCONNECTED"));
    Serial.printf("   Reason: %d, RSSI: %d\n", event.reason, ctx.lastConnectedRSSI);
    
    bool wasPasswordIssue = false;
    bool wasPoorSignal = false;
    
    switch (event.reason) {
        case WIFI_DISCONNECT_REASON_AUTH_FAIL:
        case WIFI_DISCONNECT_REASON_AUTH_EXPIRE:
        case WIFI_DISCONNECT_REASON_4WAY_HANDSHAKE_TIMEOUT:
        case WIFI_DISCONNECT_REASON_HANDSHAKE_TIMEOUT:
            ctx.lastFailureType = WIFI_FAIL_WRONG_PASSWORD;
            wasPasswordIssue = true;
            break;
        case WIFI_DISCONNECT_REASON_BEACON_TIMEOUT:
            ctx.lastFailureType = WIFI_FAIL_CONNECTION_LOST;
            if (ctx.lastConnectedRSSI < WIFIMGR_POOR_SIGNAL_THRESHOLD_DBM) {
                wasPoorSignal = true;
                ctx.lastFailureType = WIFI_FAIL_POOR_SIGNAL;
            }
            break;
        case WIFI_DISCONNECT_REASON_NO_AP_FOUND:
            ctx.lastFailureType = WIFI_FAIL_SSID_NOT_FOUND;
            break;
        default:
            ctx.lastFailureType = WIFI_FAIL_UNKNOWN;
            if (ctx.lastConnectedRSSI < WIFIMGR_POOR_SIGNAL_THRESHOLD_DBM) {
                wasPoorSignal = true;
            }
            break;
    }
    
    if (wasPoorSignal && ctx.state == WIFI_MGR_CONNECTED) {
        handlePoorSignalDisconnect();
    }
    
    if (wasPasswordIssue) {
        handleWrongPassword();
        return;
    }
    
    if (ctx.state == WIFI_MGR_CONNECTED) {
        onConnectionLost();
        ctx.lastDisconnectTime = now;
        ctx.consecutiveDisconnects++;
        
        if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
            ctx.quickRetryCount = 0;
            transitionState(WIFI_MGR_HUNT_SCANNING, "disconnect");
        } else {
            transitionState(WIFI_MGR_IDLE, "disconnect");
        }
    }
    
    ctx.isConnecting = false;
}

static void onWiFiGotIP(const WiFiEventStationModeGotIP& event) {
    Serial.println(F("\nâœ… CONNECTED"));
    Serial.print(F("   IP: ")); Serial.println(event.ip);
    Serial.printf("   RSSI: %d dBm\n", WiFi.RSSI());
    
    ctx.isConnecting = false;
    transitionState(WIFI_MGR_CONNECTED, "got IP");
    
    // Reset all counters
    ctx.savedNetworkAttempts = 0;
    ctx.currentHardcodedIndex = 0;
    ctx.backoffMultiplier = 1;
    ctx.quickRetryCount = 0;
    ctx.wrongPasswordCount = 0;
    ctx.authFailureCount = 0;
    ctx.consecutiveScanMisses = 0;
    ctx.consecutiveDisconnects = 0;
    ctx.lastFailureType = WIFI_FAIL_NONE;
    rtcWiFiData.failedAttemptsSinceSuccess = 0;
    
    ctx.lastSuccessfulConnection = millis();
    ctx.lastConnectedRSSI = WiFi.RSSI();
    ctx.lastRSSI = ctx.lastConnectedRSSI;
    ctx.goodSignalStartTime = 0;
    
    if (ctx.lastRSSI > ctx.bestSeenRSSI) ctx.bestSeenRSSI = ctx.lastRSSI;
    
    strncpy(rtcWiFiData.lastConnectedSSID, WiFi.SSID().c_str(), 
            sizeof(rtcWiFiData.lastConnectedSSID) - 1);
    saveRTCWiFiData();
    
    if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
        onHuntConnectionEstablished();
    } else {
        onConnectionEstablished();
    }
}

// ===================== FAILURE HANDLERS =====================
static void handleWrongPassword(void) {
    ctx.wrongPasswordCount++;
    ctx.lastFailureType = WIFI_FAIL_WRONG_PASSWORD;
    
    Serial.printf("ðŸ” Wrong password: %d/%d\n", 
                  ctx.wrongPasswordCount, WIFIMGR_MAX_WRONG_PASSWORD_ATTEMPTS);
    
    if (ctx.wrongPasswordCount >= WIFIMGR_MAX_WRONG_PASSWORD_ATTEMPTS) {
        enterAPMode("Wrong password", true, false);
    } else {
        if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
            transitionState(WIFI_MGR_HUNT_LIGHT_SLEEP, "wrong pw");
        } else {
            transitionState(WIFI_MGR_WAITING_BACKOFF, "wrong pw");
        }
    }
}

static void handleAuthFailure(void) {
    ctx.authFailureCount++;
    ctx.lastFailureType = WIFI_FAIL_WRONG_PASSWORD;
    
    Serial.printf("ðŸ” Auth failure: %d/%d\n", 
                  ctx.authFailureCount, WIFIMGR_MAX_AUTH_FAILURES);
    
    if (ctx.authFailureCount >= WIFIMGR_MAX_AUTH_FAILURES) {
        enterAPMode("Auth failed", true, false);
    } else {
        if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
            transitionState(WIFI_MGR_HUNT_LIGHT_SLEEP, "auth fail");
        } else {
            transitionState(WIFI_MGR_WAITING_BACKOFF, "auth fail");
        }
    }
}

static void handleSSIDNotFound(void) {
    ctx.consecutiveScanMisses++;
    ctx.lastFailureType = WIFI_FAIL_SSID_NOT_FOUND;
    
    if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
        transitionState(WIFI_MGR_HUNT_LIGHT_SLEEP, "not found");
    } else {
        transitionState(WIFI_MGR_WAITING_BACKOFF, "not found");
    }
}

static void handlePoorSignalDisconnect(void) {
    uint32_t now = millis();
    
    if (ctx.poorSignalWindowStart > 0 && 
        (now - ctx.poorSignalWindowStart) > WIFIMGR_POOR_SIGNAL_WINDOW_MS) {
        ctx.poorSignalDisconnectCount = 0;
        ctx.poorSignalWindowStart = 0;
    }
    
    if (ctx.poorSignalWindowStart == 0) ctx.poorSignalWindowStart = now;
    
    ctx.poorSignalDisconnectCount++;
    ctx.lastDisconnectWasPoorSignal = true;
    ctx.lastFailureType = WIFI_FAIL_POOR_SIGNAL;
    
    Serial.printf("ðŸ“¶ Poor signal: %d/%d (RSSI: %d)\n",
                  ctx.poorSignalDisconnectCount,
                  WIFIMGR_MAX_POOR_SIGNAL_DISCONNECTS,
                  ctx.lastConnectedRSSI);
}

static bool shouldFallbackToAP(void) {
    uint32_t now = millis();
    
    // Wrong password
    if (ctx.wrongPasswordCount >= WIFIMGR_MAX_WRONG_PASSWORD_ATTEMPTS) {
        enterAPMode("Wrong password", true, false);
        return true;
    }
    
    // Auth failures
    if (ctx.authFailureCount >= WIFIMGR_MAX_AUTH_FAILURES) {
        enterAPMode("Auth failed", true, false);
        return true;
    }
    
    // Poor signal window reset
    if (ctx.poorSignalWindowStart > 0 && 
        (now - ctx.poorSignalWindowStart) > WIFIMGR_POOR_SIGNAL_WINDOW_MS) {
        ctx.poorSignalDisconnectCount = 0;
        ctx.poorSignalWindowStart = 0;
    }
    
    // Poor signal disconnects
    if (ctx.poorSignalDisconnectCount >= WIFIMGR_MAX_POOR_SIGNAL_DISCONNECTS) {
        enterAPMode("Poor signal", false, true);
        return true;
    }
    
    // Protect Telegram
    if (telegramSendPending || telegramDelayActive || telegramSending) {
        return false;
    }
    
