bhavilbhanushali28-ai/esp8266-build1/aqua/WiFiManager.cpp
    return false;
}

static void enterAPMode(const char* reason, bool authFailure, bool poorSignal) {
    Serial.println(F("\nðŸ“¡ ===== ENTERING AP MODE ====="));
    Serial.print(F("   Reason: ")); Serial.println(reason);
    
    ctx.apModeTriggeredByAuthFail = authFailure;
    ctx.apModeTriggeredByPoorSignal = poorSignal;
    ctx.apModeStartTime = millis();
    
    WiFi.disconnect(true);
    WiFi.scanDelete();
    ctx.scanInProgress = false;
    ctx.isConnecting = false;
    
    delay(100);
    setupAP();
    
    isApModeActive = true;
    transitionState(WIFI_MGR_AP_MODE, reason);
}

static void exitAPMode(void) {
    Serial.println(F("\nðŸ“¡ Exiting AP mode...\n"));
    
    isApModeActive = false;
    ctx.apModeTriggeredByAuthFail = false;
    ctx.apModeTriggeredByPoorSignal = false;
    
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    delay(100);
    
    ctx.consecutiveScanMisses = 0;
    ctx.huntStartTime = millis();
    
    if (ctx.apModeTriggeredByPoorSignal) {
        ctx.poorSignalDisconnectCount = 0;
        ctx.poorSignalWindowStart = 0;
    }
    
    if (ctx.operationMode == WIFI_OP_MODE_INTERMITTENT_HUNT) {
        transitionState(WIFI_MGR_HUNT_SCANNING, "AP exit");
    } else {
        transitionState(WIFI_MGR_IDLE, "AP exit");
    }
}

// ===================== CONNECTION HANDLERS =====================
static void onConnectionEstablished(void) {
    wifiConnected = true;
    isApModeActive = false;
    
    if (!telegramTriggeredForThisConnection) {
        Serial.println(F("\nðŸ“± >>> TELEGRAM TRIGGERED <<<\n"));
        telegramTriggeredForThisConnection = true;
        telegramSendPending = true;
        telegramDelayActive = false;
        telegramSending = false;
        telegramRetryCount = 0;
    }
    
    saveConnectedCredentialsIfNew();
    
    if (lastTimeSync == 0) {
        syncTimeFromNTP();
        lastTimeSync = millis();
    }
}

static void onHuntConnectionEstablished(void) {
    Serial.println(F("\nðŸŽ¯ ===== HUNT SUCCESS! ====="));
    
    wifiConnected = true;
    isApModeActive = false;
    
    ctx.lastConnectedRSSI = WiFi.RSSI();
    ctx.lastRSSI = ctx.lastConnectedRSSI;
    ctx.huntStartTime = millis();
    ctx.consecutiveDisconnects = 0;
    
    Serial.printf("   RSSI: %d dBm %s\n", ctx.lastConnectedRSSI, 
                  getSignalQuality(ctx.lastConnectedRSSI));
    
    if (!telegramTriggeredForThisConnection) {
        Serial.println(F("ðŸ“± >>> IMMEDIATE TELEGRAM <<<"));
        telegramTriggeredForThisConnection = true;
        telegramSendPending = true;
        telegramDelayActive = false;
        telegramSending = false;
        telegramRetryCount = 0;
    }
    
    syncTimeFromNTP();
    lastTimeSync = millis();
    
    saveConnectedCredentialsIfNew();
    Serial.println(F("============================\n"));
}

static void onConnectionLost(void) {
    wifiConnected = false;
    telegramTriggeredForThisConnection = false;
    ctx.goodSignalStartTime = 0;
}

static void saveConnectedCredentialsIfNew(void) {
    String currentSSID = WiFi.SSID();
    
    if (!currentSSID.equals(settings.staSsid)) {
        currentSSID.toCharArray(settings.staSsid, sizeof(settings.staSsid));
        
        for (size_t i = 0; i < NUM_HARDCODED_NETWORKS; i++) {
            if (currentSSID.equals(hardcodedNetworks[i].ssid)) {
                strncpy(settings.staPassword, hardcodedNetworks[i].password,
                        sizeof(settings.staPassword) - 1);
                settings.staPassword[sizeof(settings.staPassword) - 1] = '\0';
                break;
            }
        }
        saveSettings();
    }
    
    strncpy(ctx.targetSSID, settings.staSsid, sizeof(ctx.targetSSID) - 1);
}

// ===================== HELPER FUNCTIONS =====================
static void transitionState(WifiMgrState newState, const char* reason) {
    if (ctx.state != newState) {
        ctx.previousState = ctx.state;
        Serial.printf("ðŸ”„ %s â†’ %s", getWiFiStateNameByState(ctx.state), 
                      getWiFiStateNameByState(newState));
        if (reason && strlen(reason) > 0) Serial.printf(" (%s)", reason);
        Serial.println();
        ctx.state = newState;
        ctx.lastAttemptTime = millis();
    }
}

static bool tryConnectToNetwork(const char* ssid, const char* password) {
    WiFi.disconnect(true);
    delay(10);
    Serial.print(F("ðŸ“¶ Connecting: ")); Serial.println(ssid);
    WiFi.begin(ssid, password);
    ctx.connectionStartTime = millis();
    ctx.lastAttemptTime = millis();
    ctx.isConnecting = true;
    return true;
}

static void tryConnectToHardcodedNetwork(uint8_t index) {
    if (index >= ctx.availableNetworkCount) return;
    uint8_t actualIndex = ctx.cachedNetworkIndices[index];
    tryConnectToNetwork(hardcodedNetworks[actualIndex].ssid,
                        hardcodedNetworks[actualIndex].password);
}

static bool startAsyncScan(void) {
    int8_t status = WiFi.scanComplete();
    if (status == -1) return true;
    if (status >= 0) WiFi.scanDelete();
    WiFi.scanNetworks(true, true);
    ctx.lastScanTime = millis();
    return true;
}

static bool isTargetInScanResults(int scanCount) {
    const char* target = strlen(ctx.targetSSID) > 0 ? ctx.targetSSID : settings.staSsid;
    if (strlen(target) == 0) return false;
    
    for (int i = 0; i < scanCount; i++) {
        if (WiFi.SSID(i).equals(target)) {
            ctx.lastRSSI = WiFi.RSSI(i);
            return true;
        }
    }
    
    for (size_t h = 0; h < NUM_HARDCODED_NETWORKS; h++) {
        for (int i = 0; i < scanCount; i++) {
            if (WiFi.SSID(i).equals(hardcodedNetworks[h].ssid)) {
                ctx.lastRSSI = WiFi.RSSI(i);
                return true;
            }
        }
    }
    return false;
}

static void cacheAvailableNetworks(int scanCount) {
    ctx.availableNetworkCount = 0;
    for (uint8_t h = 0; h < NUM_HARDCODED_NETWORKS && 
                        ctx.availableNetworkCount < sizeof(ctx.cachedNetworkIndices); h++) {
        for (int i = 0; i < scanCount; i++) {
            if (WiFi.SSID(i).equals(hardcodedNetworks[h].ssid)) {
                ctx.cachedNetworkIndices[ctx.availableNetworkCount++] = h;
                break;
            }
        }
    }
    ctx.scanResultsCached = true;
}

static uint32_t calculateBackoffDelay(void) {
    uint32_t backoff = WIFIMGR_RECONNECT_INTERVAL_MS * ctx.backoffMultiplier;
    if (ctx.backoffMultiplier < WIFIMGR_MAX_BACKOFF_MULTIPLIER) {
        ctx.backoffMultiplier *= 2;
    }
    return backoff;
}

// ===================== POWER MANAGEMENT =====================
static void exitLightSleep(void) {
    WiFi.forceSleepWake();
    delay(1);
}

static void yieldWithLightSleep(uint32_t ms) {
    if (ms >= 10) {
        WiFi.forceSleepBegin();
        delay(ms);
        WiFi.forceSleepWake();
        delay(1);
    } else {
        delay(ms);
    }
    yield();
}

// ===================== RTC PERSISTENCE =====================
static uint32_t calculateCRC32(const uint8_t* data, size_t length) {
    uint32_t crc = 0xFFFFFFFF;
    while (length--) {
        crc ^= *data++;
        for (int i = 0; i < 8; i++) {
            crc = (crc >> 1) ^ (0xEDB88320 & -(crc & 1));
        }
    }
    return ~crc;
}

static void loadRTCWiFiData(void) {
    ESP.rtcUserMemoryRead(64, (uint32_t*)&rtcWiFiData, sizeof(rtcWiFiData));
    
    uint32_t expectedCRC = calculateCRC32(
        ((uint8_t*)&rtcWiFiData) + sizeof(rtcWiFiData.crc),
        sizeof(rtcWiFiData) - sizeof(rtcWiFiData.crc));
    
    if (expectedCRC != rtcWiFiData.crc) {
        memset(&rtcWiFiData, 0, sizeof(rtcWiFiData));
    }
}

static void saveRTCWiFiData(void) {
    rtcWiFiData.crc = calculateCRC32(
        ((uint8_t*)&rtcWiFiData) + sizeof(rtcWiFiData.crc),
        sizeof(rtcWiFiData) - sizeof(rtcWiFiData.crc));
    ESP.rtcUserMemoryWrite(64, (uint32_t*)&rtcWiFiData, sizeof(rtcWiFiData));
}

// ===================== UTILITY =====================
static const char* getSignalQuality(int8_t rssi) {
    if (rssi >= -50) return "(Excellent)";
    if (rssi >= -60) return "(Good)";
    if (rssi >= -70) return "(Fair)";
    if (rssi >= -80) return "(Weak)";
    return "(Very Weak)";
}

// ===================== DEBUG =====================
void printWiFiManagerStatus(void) {
    Serial.println(F("\n========== WiFi Manager =========="));
    Serial.printf("State: %s\n", getWiFiStateName());
    Serial.printf("Mode: %s\n", isInHuntMode() ? "HUNT" : "NORMAL");
    Serial.printf("Connected: %s\n", wifiConnected ? "YES" : "NO");
    
    if (wifiConnected) {
        Serial.printf("RSSI: %d dBm %s\n", WiFi.RSSI(), getSignalQuality(WiFi.RSSI()));
        Serial.print(F("IP: ")); Serial.println(WiFi.localIP());
    }
    
    Serial.printf("Target: %s\n", strlen(ctx.targetSSID) > 0 ? ctx.targetSSID : "(none)");
    Serial.printf("Scans: %d\n", ctx.totalScanCount);
    Serial.printf("Wrong PW: %d/%d\n", ctx.wrongPasswordCount, WIFIMGR_MAX_WRONG_PASSWORD_ATTEMPTS);
    Serial.printf("Auth fail: %d/%d\n", ctx.authFailureCount, WIFIMGR_MAX_AUTH_FAILURES);
    Serial.printf("Poor signal: %d/%d\n", ctx.poorSignalDisconnectCount, WIFIMGR_MAX_POOR_SIGNAL_DISCONNECTS);
    Serial.printf("Heap: %u\n", ESP.getFreeHeap());
    Serial.println(F("==================================\n"));
}